Revit 2027 API
RebarShapeDefinition.GetParameterFormula Method
 Return the parameter's formula, if one is associated with it.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetParameterFormula(
	ElementId paramId
)
Public Function GetParameterFormula (
	paramId As ElementId
) As String
public:
String^ GetParameterFormula(
	ElementId^ paramId
)
member GetParameterFormula :
        paramId : ElementId -> string
Parameters
paramId ElementId
 Id of a parameter in the definition.
Return Value
String
 The formula, or an empty string if there is no formula for the parameter.
Exceptions
Exception | Condition
ArgumentException |  This RebarShapeDefinition does not have a value for the parameter paramId.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
RebarShapeDefinition Class
Autodesk.Revit.DB.Structure Namespace